Code/Analysis/data/GM0125/constant/interfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      interfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- diffuse interface width
epsilon                     epsilon [ 0 1 0 0 0 0 0 ] 1.7e-9; // R/20
//nInterfaceCells	6;

//- diffuse interface type
diffuseInterfaceType capillaryInterface;

capillaryInterface
{
    interfaceRelaxation
    {
        model equilibrium;//relaxation;//equilibrium;
    };
    sigmas
    (
        ( air water ) 0.072
    );

    Marangoni
    {
        switchMarangoni     off;

        model linear;

        T0                  T0 [ 0 0 0 1 0 0 0 ] 273.1;

        sigmaTs
        (
            /*( air water ) 0.2*/
        );
    }
}

// ************************************************************************* //
